Revit 2024 API
View.GetBackground Method
 Returns the current background set for the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ViewDisplayBackground GetBackground()
Visual Basic
Public Function GetBackground As ViewDisplayBackground
Visual C++
public:
ViewDisplayBackground^ GetBackground()
Return Value
 Current background.
See Also
View Class
Autodesk.Revit.DB Namespace